blerf.org
#+hugo_base_dir: ./
#+hugo_section: words

#+seq_todo: TODO DRAFT DONE

#+property: header-args :eval never-export
#+options: creator:t

#+STARTUP: indent
#+STARTUP: logdone

#+AUTHOR: Sam Pillsworth

** DONE I blerfed it :nonsense:
CLOSED: [2023-01-23 Mon 23:23]
:PROPERTIES:
:EXPORT_FILE_NAME: blerfed-it
:END:
What's up nerds[fn:1], I'm back. Trying to figure this whole situation out.
To figure out:
- [X] is this post getting generated?
- [X] how to make a footnote?
- [X] What do these checkboxes look like?
  - they look totally reasonable
- [X] Did I figure out syntax highlighting?
  + hot damn I did! Good job Past Sam!
- [X] different code styling?
- [X] line numbers??

I am looking at this on a small screen and it looks not great. I think I would like to experiment
with different themes that are better layouts on a small screen.

#+begin_src scala
// this is just some sample code to check highlighting
def blerf(name: String): Unit = println(s"Hey, ${name}, did you know that Sam blerfed it?")
#+end_src

*** To remember in the future
- If the netlify preview build fails but everything works locally, check the hugo version
- not all chromastyles are available it seems?
- the leading slashes for the logo paths are important
