content/words/blerfed-it.md
+++
title = "I blerfed it"
author = ["Sam Pillsworth"]
date = 2023-01-23T23:23:00-05:00
tags = ["nonsense"]
draft = false
creator = "Emacs 28.2 (Org mode 9.5 + ox-hugo)"
+++

What's up nerds[^fn:1], I'm back. Trying to figure this whole situation out.
To figure out:

-   [X] is this post getting generated?
-   [X] how to make a footnote?
-   [X] What do these checkboxes look like?
    -   they look totally reasonable
-   [X] Did I figure out syntax highlighting?
    -   hot damn I did! Good job Past Sam!
-   [X] different code styling?
-   [X] line numbers??

I am looking at this on a small screen and it looks not great. I think I would like to experiment
with different themes that are better layouts on a small screen.

```scala
// this is just some sample code to check highlighting
def blerf(name: String): Unit = println(s"Hey, ${name}, did you know that Sam blerfed it?")
```


## To remember in the future {#to-remember-in-the-future}

-   If the netlify preview build fails but everything works locally, check the hugo version
-   not all chromastyles are available it seems?
-   the leading slashes for the logo paths are important

[^fn:1]: It's me. My past self is nerds.
